1password
base
base-devel
bat
brave-bin
brightnessctl
broadcom-wl-dkms
btop
cliphist
cmake
efibootmgr
eza
fastfetch
fd
fzf
ghostty
git
github-cli
grimblast-git
hypridle
hyprland
hyprlock
hyprpicker
inotify-tools
intel-ucode
kitty
kvantum
kvantum-theme-catppuccin-git
less
libnotify
libxkbcommon
linux
linux-firmware
linux-headers
mako
mesa-utils
meson
nautilus
neovim
networkmanager
nwg-look
pamixer
paru
pipewire
pipewire-pulse
polkit-kde-agent
qt5-wayland
qt5ct
qt6-wayland
qt6ct
ripgrep
sddm
seatd
starship
swww
tlp
tlp-rdw
tofi
ttf-jetbrains-mono
ttf-jetbrains-mono-nerd
ttf-nerd-fonts-symbols
ttf-nerd-fonts-symbols-mono
unzip
vivid
waybar
wayland-protocols
wget
wireplumber
wlogout-git
xdg-desktop-portal-hyprland
xorg-xwayland
yazi
zen-browser-bin
zoxide
zram-generator
zsh
zsh-antidote
